app/controllers/pets_controller.rb

INSERT INTO "pets" ("name", "image", "about", "user_id", "created_at", "updated_at", "species_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @pet = Pet.new(food_params)
    @pet.user = @current_user

    if @pet.save

UPDATE "pets" SET "name" = $1, "about" = $2, "updated_at" = $3 WHERE "pets"."id" = $4  [["name", "Pebble"], ["about", "Beep beep"], ["updated_at", "2020-08-15 18:02:27.809700"], ["id", 10]]
---
  def update
    if @pet.update(pet_params)

DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 11]]
---
  def destroy
    @pet.destroy