app/controllers/species_controller.rb

SELECT "species".* FROM "species"
---
    def index
        @species = Species.all